In [8]:
import pandas as pd

In [9]:
india_weather=pd.DataFrame({
    
   "city":["mumbai","delhi","banglore"],
   "temperature":[32,45,30],
   "humidity":[80,60,78]})

In [12]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [13]:
us_weather=pd.DataFrame({
    
   "city":["nework","chicaho","orlando"],
   "temperature":[21,14,35],
   "humidity":[69,65,75]})

us_weather

      city  temperature  humidity
0   nework           21        69
1  chicaho           14        65
2  orlando           35        75

In [14]:
df=pd.concat([india_weather,us_weather])

In [15]:
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0    nework           21        69
1   chicaho           14        65
2   orlando           35        75

In [16]:
df=pd.concat([india_weather,us_weather],ignore_index=True)

In [17]:
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3    nework           21        69
4   chicaho           14        65
5   orlando           35        75

In [21]:
df=pd.concat([india_weather,us_weather],keys=["india","us"])

In [22]:
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0    nework           21        69
      1   chicaho           14        65
      2   orlando           35        75

In [23]:
df.loc["us"]

      city  temperature  humidity
0   nework           21        69
1  chicaho           14        65
2  orlando           35        75

In [25]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [28]:
temperature_df=pd.DataFrame({
    
    
    "city":["nework","chicaho","orlando"],
   "temperature":[21,14,35],
    
   
})

In [29]:
temperature_df

      city  temperature
0   nework           21
1  chicaho           14
2  orlando           35

In [32]:
windspeed_df=pd.DataFrame({
    
    "city":["nework","chicaho","orlando"],
    "windspeed":[7,12,9],
})

In [33]:
windspeed_df

      city  windspeed
0   nework          7
1  chicaho         12
2  orlando          9

In [35]:
df=pd.concat([temperature_df,windspeed_df])

In [36]:
df

      city  temperature  windspeed
0   nework         21.0        NaN
1  chicaho         14.0        NaN
2  orlando         35.0        NaN
0   nework          NaN        7.0
1  chicaho          NaN       12.0
2  orlando          NaN        9.0

In [37]:
df=pd.concat([temperature_df,windspeed_df],axis=1)

In [38]:
df

      city  temperature     city  windspeed
0   nework           21   nework          7
1  chicaho           14  chicaho         12
2  orlando           35  orlando          9

In [41]:
temperature_df=pd.DataFrame({
    
    
    "city":["nework","chicaho","orlando"],
   "temperature":[21,14,35],
    
   
},index=[0,1,2])

In [43]:
windspeed_df=pd.DataFrame({
    
    "city":["chicaho","nework"],
    "windspeed":[7,12],
},index=[1,0])

In [45]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

      city  temperature     city  windspeed
0   nework           21   nework       12.0
1  chicaho           14  chicaho        7.0
2  orlando           35      NaN        NaN

In [47]:
s=pd.Series(["Rain","Dry","Humid"],name="event")

In [48]:
s

0     Rain
1      Dry
2    Humid
Name: event, dtype: object

In [50]:
df=pd.concat([temperature_df,s],axis=1)

In [51]:
df

      city  temperature  event
0   nework           21   Rain
1  chicaho           14    Dry
2  orlando           35  Humid